import {
  Button,
  Link,
  Navbar,
  NavbarBrand,
  NavbarContent,
  NavbarItem,
} from "@heroui/react";
import logo from "../../public/Icons/proto-2-light-short.svg";
import { useNavigate } from "react-router-dom";

const About = () => {
  const navigate = useNavigate();
  return (
    <>
      <Navbar isBordered className="bg-[#dfe9ed]">
        <NavbarBrand>
          <Link onPress={() => navigate("/")}>
            <img src={logo} alt="website logo" width={150} height={150} />
          </Link>
        </NavbarBrand>
        <NavbarContent className="hidden sm:flex gap-80">
          <NavbarItem>
            <Link
              // href="/about"
              className="text-black font-semibold hover:text-slate-700 hover:text-lg transition-all duration-300"
              onPress={() => navigate("/about")}
            >
              О проекте
            </Link>
          </NavbarItem>
          <NavbarItem>
            <Button
              color="primary"
              variant="shadow"
              className="p-5 text-lg"
              onPress={() => navigate("/signin")}
            >
              Войти
            </Button>
          </NavbarItem>
        </NavbarContent>
      </Navbar>
      <div className="p-10 bg-[#dfe9ed]">
        <article className="w-[70%] mx-auto text-justify border-1 p-10 rounded-lg shadow bg-slate-100">
          <p className="text-lg/7">
            Современные технологии аддитивного производства, также известного
            как 3D-печать, стремительно развиваются и находят применение в самых
            разных отраслях, включая промышленное производство, медицину,
            строительство и дизайн. Одним из наиболее популярных методов
            является FDM (Fused Deposition Modeling), который широко
            используется благодаря своей доступности и универсальности. Однако
            качество и стабильность результатов FDM-печати во многом зависят от
            условий окружающей среды, таких как температура, влажность и
            вентиляция. Эти факторы оказывают значительное влияние на свойства
            материалов, точность печати и долговечность изделий.
          </p>
          <p>
            В процессе плавления и экструзии пластиковых филаментов (особенно
            ABS и в меньшей степени PLA) выделяются ультрамелкие частицы (UFP) и
            летучие органические соединения (ЛОС), которые могут проникать
            глубоко в легкие, вызывать воспаление, раздражение глаз, носа и
            горла, а также оказывать токсическое воздействие на организм,
            включая потенциальное канцерогенное действие некоторых веществ.
            Наибольший риск представляют длительное пребывание в плохо
            проветриваемых помещениях рядом с работающим 3D-принтером и
            регулярное вдыхание этих выбросов, что особенно опасно для людей с
            хроническими респираторными заболеваниями.
          </p>
          <p>
            Согласно ГОСТ 12.1.005–88 и СанПиН 2.2.4.3359–16, в холодный период
            года температура воздуха в рабочих помещениях должна составлять
            22-24 °C, а в теплый период года – 23-25 °C. Относительная влажность
            воздуха должна находиться в диапазоне 40-60%, что предотвращает
            излишнюю сухость или влажность, негативно влияющие на здоровье
            сотрудников и состояние оборудования.
          </p>
          <p>
            Скорость движения воздуха в помещениях с вычислительной техникой не
            должна превышать 0,1 м/с, что позволяет избежать неприятных
            сквозняков и обеспечивает комфортную рабочую обстановку. Эти
            параметры создают предпосылки для поддержания теплового комфорта
            сотрудников, предотвращения перегрева или переохлаждения, а также
            для обеспечения нормальной работы оборудования. ГОСТ 12.1.005–88
            также устанавливает требования по контролю содержания вредных
            веществ в воздухе рабочей зоны. Контроль содержания вредных веществ
            в воздухе также регламентируется СанПиН 2.2.4.3359–16. В рабочей
            зоне должны регулярно проводиться пробы воздуха для определения
            концентраций вредных веществ. Частота контроля зависит от класса
            опасности веществ: для веществ I класса опасности пробы отбираются
            не реже одного раза в 10 дней, для веществ II класса – не реже
            одного раза в месяц, а для веществ III и IV классов – не реже одного
            раза в квартал. Это позволяет своевременно выявлять и устранять
            потенциальные источники загрязнения воздуха, обеспечивая безопасные
            условия труда и особенно важно в условиях использования электроники
            и оборудования, которое может выделять вредные вещества при
            нагревании или износе.
          </p>
          <p>
            Освещение рабочих зон является еще одним важным аспектом создания
            комфортных условий труда. В соответствии с СанПиНом 2.2.4.3359–16, в
            рабочих помещениях должно быть предусмотрено как естественное, так и
            искусственное освещение. Естественное освещение желательно
            использовать максимально, обеспечивая достаточное количество
            дневного света. В случае его недостаточности должны быть установлены
            системы искусственного освещения.
          </p>
          <p>
            Параметры освещения включают уровень освещенности, распределение
            света и цветовую температуру. Для работы с компьютерами и
            документами необходимый уровень освещенности в диапазоне 300–500 лк.
            Освещение должно быть равномерным, чтобы избежать резких теней и
            бликов на рабочих поверхностях и экранах мониторов, что снижает
            зрительное напряжение и утомляемость сотрудников. Рекомендуемая
            цветовая температура источников света составляет 4000–5000 К, что
            обеспечивает комфортные условия работы и способствует повышению
            производительности труда.
          </p>
          <p>
            Актуальность разработки программно-технического комплекса "Envmon"
            обусловлена несколькими ключевыми аспектами. Во-первых, контроль
            температуры и влажности позволяет минимизировать дефекты печати,
            такие как деформация, растрескивание или плохая адгезия слоев.
            Например, для печати материалов типа PLA оптимальная температура
            помещения составляет 20–25 °C, а для ABS –25–30 °C. Кроме того,
            влажность должна находиться в пределах 40–60%, чтобы предотвратить
            поглощение влаги материалами и их последующее разрушение. Во-вторых,
            создание стабильного микроклимата способствует повышению
            повторяемости результатов печати, что особенно важно для массового
            производства сложных изделий с высокими требованиями к качеству.
          </p>
          <p>
            Технологии мониторинга и управления микроклиматом уже доказали свою
            эффективность в аддитивном производстве. Например, использование
            замкнутых систем контроля позволяет динамически регулировать
            параметры печати в реальном времени, предотвращая возникновение
            дефектов и улучшая механические свойства изделий. Кроме того,
            внедрение таких систем способствует снижению отходов материалов и
            увеличению производительности процессов.
          </p>{" "}
          <p>
            Программно-технический комплекс для отображения поведение
            отслеживаемых параметров микроклимата использует графики и таблицы.
            Этот подход призван обеспечить стабильность и однородность условий
            окружающей среды, что необходимо для производства высококачественной
            печатной продукции. В конечном счете, это исследование позволит
            получить ценную информацию об улучшении условий эксплуатации
            FDM-печати в промышленных условиях.
          </p>
        </article>
      </div>
    </>
  );
};

export default About;
